{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 32,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 32
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<BOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<EOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "<BOS>": 2,
      "<EOS>": 3,
      "가벼운": 4,
      "가볍고": 5,
      "가뿐하고": 6,
      "가오리": 7,
      "갈매기": 8,
      "강력하고": 9,
      "강아지": 10,
      "강인하고": 11,
      "강한": 12,
      "개구리": 13,
      "거대한": 14,
      "거미": 15,
      "거북이": 16,
      "거친": 17,
      "거칠고": 18,
      "건강하고": 19,
      "경건하고": 20,
      "경쾌하고": 21,
      "고라니": 22,
      "고래": 23,
      "고슴도치": 24,
      "고양이": 25,
      "고요한": 26,
      "고운": 27,
      "곰": 28,
      "귀여운": 29,
      "귀엽고": 30,
      "근엄하고": 31,
      "금붕어": 32,
      "금빛의": 33,
      "기괴한": 34,
      "기름진": 35,
      "기린": 36,
      "기발한": 37,
      "기운찬": 38,
      "까마귀": 39,
      "까치": 40,
      "깔끔하고": 41,
      "깔끔한": 42,
      "꼼꼼하고": 43,
      "나비": 44,
      "낙타": 45,
      "날렵하고": 46,
      "날씬한": 47,
      "날카로운": 48,
      "너구리": 49,
      "노르웨이숲고양이": 50,
      "눈부신": 51,
      "느긋하고": 52,
      "느리고": 53,
      "느린": 54,
      "늑대": 55,
      "다람쥐": 56,
      "다정하고": 57,
      "단단하고": 58,
      "단단한": 59,
      "단순하고": 60,
      "단아하고": 61,
      "단정하고": 62,
      "단정한": 63,
      "단호한": 64,
      "달콤하고": 65,
      "달콤한": 66,
      "닭": 67,
      "담백한": 68,
      "당나귀": 69,
      "당당하고": 70,
      "도마뱀": 71,
      "도베르만": 72,
      "독수리": 73,
      "독창적이고": 74,
      "독특하고": 75,
      "돌고래": 76,
      "돼지": 77,
      "두꺼비": 78,
      "두더지": 79,
      "둥근": 80,
      "든든하고": 81,
      "따끈하고": 82,
      "따끈한": 83,
      "따뜻하고": 84,
      "따뜻한": 85,
      "따사롭고": 86,
      "딱정벌레": 87,
      "똑똑하고": 88,
      "똑똑한": 89,
      "라쿤": 90,
      "랙돌": 91,
      "러시안블루": 92,
      "리트리버": 93,
      "말": 94,
      "말끔하고": 95,
      "말랑한": 96,
      "말벌": 97,
      "말티즈": 98,
      "매": 99,
      "매력적이고": 100,
      "매력적인": 101,
      "매미": 102,
      "매서운": 103,
      "먼치킨": 104,
      "멋진": 105,
      "메뚜기": 106,
      "명랑하고": 107,
      "명석하고": 108,
      "무거운": 109,
      "무난한": 110,
      "문어": 111,
      "미묘한": 112,
      "미어캣": 113,
      "바다거북": 114,
      "바다사자": 115,
      "바다표범": 116,
      "반달가슴곰": 117,
      "반짝이고": 118,
      "반짝이는": 119,
      "밝은": 120,
      "백조": 121,
      "뱀": 122,
      "뱅갈고양이": 123,
      "벌": 124,
      "보더콜리": 125,
      "부드러운": 126,
      "부드럽고": 127,
      "부러운": 128,
      "부엉이": 129,
      "부지런하고": 130,
      "북극곰": 131,
      "분석적이고": 132,
      "분홍빛의": 133,
      "불곰": 134,
      "불타는": 135,
      "붕어": 136,
      "비둘기": 137,
      "빠르고": 138,
      "빠른": 139,
      "사려깊고": 140,
      "사마귀": 141,
      "사슴": 142,
      "사자": 143,
      "산뜻하고": 144,
      "산뜻한": 145,
      "상냥하고": 146,
      "상냥한": 147,
      "상어": 148,
      "상큼하고": 149,
      "상큼한": 150,
      "새로운": 151,
      "샴고양이": 152,
      "서늘한": 153,
      "선명한": 154,
      "섬세한": 155,
      "성실하고": 156,
      "세심하고": 157,
      "셰퍼드": 158,
      "소": 159,
      "송사리": 160,
      "수달": 161,
      "수상한": 162,
      "수수하고": 163,
      "수줍고": 164,
      "수줍어하고": 165,
      "순박하고": 166,
      "순하고": 167,
      "순한": 168,
      "스산한": 169,
      "스컹크": 170,
      "스코티시폴드": 171,
      "스피츠": 172,
      "시바견": 173,
      "시원하고": 174,
      "시원한": 175,
      "실키한": 176,
      "싱거운": 177,
      "싱그러운": 178,
      "씩씩하고": 179,
      "아르마딜로": 180,
      "아비시니안": 181,
      "악어": 182,
      "알파카": 183,
      "애매한": 184,
      "앵무새": 185,
      "야무지고": 186,
      "약한": 187,
      "양": 188,
      "어두운": 189,
      "얼룩말": 190,
      "엄격하고": 191,
      "엉뚱하고": 192,
      "여우": 193,
      "여치": 194,
      "열정적이고": 195,
      "염소": 196,
      "영롱한": 197,
      "영리하고": 198,
      "영리한": 199,
      "예리한": 200,
      "예쁜": 201,
      "오소리": 202,
      "오징어": 203,
      "온순하고": 204,
      "온화하고": 205,
      "올빼미": 206,
      "용감하고": 207,
      "용감한": 208,
      "우둔한": 209,
      "우아하고": 210,
      "우직하고": 211,
      "울퉁불퉁한": 212,
      "웰시코기": 213,
      "유능하고": 214,
      "유쾌하고": 215,
      "유쾌한": 216,
      "은근한": 217,
      "은빛의": 218,
      "은은한": 219,
      "의욕적이고": 220,
      "의젓하고": 221,
      "이구아나": 222,
      "이해심있고": 223,
      "익숙한": 224,
      "잉어": 225,
      "자상하고": 226,
      "자유로운": 227,
      "작고": 228,
      "작렬하는": 229,
      "작은": 230,
      "잔잔한": 231,
      "잠자리": 232,
      "재규어": 233,
      "재밌고": 234,
      "전갈": 235,
      "정갈하고": 236,
      "정성스럽고": 237,
      "정열적이고": 238,
      "정직하고": 239,
      "조용하고": 240,
      "조용한": 241,
      "족제비": 242,
      "중후하고": 243,
      "지적인": 244,
      "지혜롭고": 245,
      "진지하고": 246,
      "진한": 247,
      "짜릿하고": 248,
      "차가운": 249,
      "차분하고": 250,
      "차분한": 251,
      "참새": 252,
      "창의적이고": 253,
      "청량하고": 254,
      "청명하고": 255,
      "청순하고": 256,
      "촉촉한": 257,
      "총명하고": 258,
      "치와와": 259,
      "치타": 260,
      "친절하고": 261,
      "친칠라": 262,
      "카멜레온": 263,
      "코끼리": 264,
      "코뿔소": 265,
      "코알라": 266,
      "코요테": 267,
      "큰": 268,
      "킹크랩": 269,
      "태연한": 270,
      "터키시앙고라": 271,
      "토끼": 272,
      "통찰력있고": 273,
      "투명한": 274,
      "투박한": 275,
      "특이한": 276,
      "튼튼하고": 277,
      "튼튼한": 278,
      "파릇한": 279,
      "판다": 280,
      "패럿": 281,
      "페네크여우": 282,
      "페르시안고양이": 283,
      "펭귄": 284,
      "평범한": 285,
      "평화로운": 286,
      "포근하고": 287,
      "폭신한": 288,
      "표범": 289,
      "푸들": 290,
      "푸르고": 291,
      "푸른": 292,
      "풍뎅이": 293,
      "풍성한": 294,
      "퓨마": 295,
      "프레리독": 296,
      "하마": 297,
      "하이에나": 298,
      "해달": 299,
      "해파리": 300,
      "햄스터": 301,
      "현명하고": 302,
      "호기심많고": 303,
      "호랑이": 304,
      "화끈하고": 305,
      "화려하고": 306,
      "화려한": 307,
      "화사하고": 308,
      "활기차고": 309,
      "활기찬": 310,
      "활달하고": 311,
      "활발한": 312,
      "황조롱이": 313,
      "흐릿한": 314,
      "흐뭇하고": 315,
      "흑곰": 316,
      "희미한": 317
    },
    "unk_token": "[UNK]"
  }
}